{
    "title": "KOBLE SAMMEN PCER DOKUMENTASJON",
    "Chapters": [
        {
            "title": "Planlegging",
            "sections": [
                {
                    "title": "Maskin",
                    "content": "PC-20"
                },
                {
                    "title": "Operativt system",
                    "content": "Windows 11"
                },
                {
                    "title": "Nettverks plan",
                    "content": "IP range = 192.168.1.60 --> 192.168.1.79\nSvein - 192.168.1.60\nOdin - 192.168.1.61\nHåkon – 192.168.1.62"
                },
                {
                    "title": "Navne standard",
                    "content": "PC-{siste ip nummeret}"
                },
                {
                    "title": "Partisjonering",
                    "content": "disk = 250GB\n(System) C: = 100GB av disk\n(Data) D: = 150GB av disk"
                },
                {
                    "title": "Windows versjon",
                    "content": "Windows 11 pro"
                },
                {
                    "title": "FTP server",
                    "content": "Filezilla server"
                }
            ]
        },
        {
            "title": "Utføring",
            "sections": [
                {
                    "title": "Sette opp OS",
                    "content": "Windows 11 pro ble installert på systemet med språket norsk og region til norge og partisjonert som beskrevet i planleggingen. Passord ble satt som «Skole123», Navn og brukernavn ble satt til PC-60 og svarene til backup spørsmålene er «Drømtorp»."
                },
                {
                    "title": "Sette opp nettverk",
                    "content": "PC-en sin Ethernet-port ble satt opp med IP 192.168.1.60 som tilordnet i IP-plan og subnettmask standard 255.255.255.0. Ethernet punkt 4A var koblet til PC-en og Ethernet port 6 på switchen."
                },
                {
                    "title": "Ping test",
                    "content": "Det ble gjennomført en test ved å ping PC-en fra en annen pc på nettverket og resultatet viste «Timeout»."
                },
                {
                    "title": "Løsning av ping timeout",
                    "content": "I brannmuren ble innkommende regel i brannmuren «File and Printer Sharing (Echo Request – ICMPv4-In)» aktivert og testen var gjennomført en annen gang med et vellykket ping."
                },
                {
                    "title": "Sette opp FTP server",
                    "content": "Pcen har en full install a Filezilla server med admin panelet på standard plassering. FTP serveren kjører som en service og admin panelets port er standard som kan nå fra alle nettverks adaptere med passord skole123. TLS fingerprint til serveren er lagret på desktopen i en fil med navn TLS.txt. En ny bruker ble lagt til FTP serveren med navn «Test» og passord «skole123». Virtuell path ble satt til «/» og native path som roten av «D:». I brannmuren så ble en innkommende regel med navn FTP laget som åpnet til porter 21, 49152-65534."
                },
                {
                    "title": "FTP test",
                    "content": "En test på FTP serveren ble gjennomført ved at Odin og Håkon koblet til FTP serveren og viste en stabil kobling, men når Brannmur regel «FTP» blir deaktivert så feiler koblingene."
                }
            ]
        },
        {
            "title": "Hvordan åpne brannmuren?",
            "sections": [
                {
                    "title": "Hvordan lage en brannmur regel",
                    "content": "Åpnet opp «Windows defender brannmur med avansert sikkerhet» og velge enten innkommende regler eller utgående regler. Innkommende regler vil være regler for når noen andre prøver å kontakte deg. Utgående regler vil si hva som har lov til å kontakte andre enheter. Når du har valget en av de så vil du se på høyre siden av vindu at det står «Ny regel …», trykk på den og et vindu burde vise seg. I det nye vindu trykk på «Port» siden det er hovedsakelig hva som du vil bruke for å åpne brannmuren for en service så trykker du neste. Der velger du om det er TCP eller UDP, under det finner du et felt som er markert med «Bestemte eksterne». Der skriver du port nummert du skal åpne som du må sikkert søke opp, når du har fått skrevet det inn trykker du neste. Her bestemmer om du skal lukke brannmuren, lukke den hvis koblingen er ikke sikker eller tillatt alt. Jeg velger tillatt alt siden koblingen kommer ikke alltid til å være sikker så trykker jeg neste. Jeg lar alt være sånn det er, men de beskriver på hvilken type nett denne reglen skal gjelde for. Trykk neste og gi den et beskrivende navn og trykk fullfør, gratulerer du har laget en brannmur regel."
                },
                {
                    "title": "Hvordan skru av en brannmur regel",
                    "content": "Åpnet opp «Windows defender brannmur med avansert sikkerhet» og velge enten innkommende regler eller utgående regler basert på hvilken regel du prøver å skru av, når du har trykket det så må du prøve å finne navnet av reglen i den lange listen. Når du har funnet den så høyre klikker du på den og trykker «deaktiver regel»."
                },
                {
                    "title": "Hvordan skru på en brannmur regel",
                    "content": "Åpnet opp «Windows defender brannmur med avansert sikkerhet» og velge enten innkommende regler eller utgående regler basert på hvilken regel du prøver å skru på, når du har trykket det så må du prøve å finne navnet av reglen i den lange listen. Når du har funnet den så høyre klikker du på den og trykker «aktiver regel»."
                }
                ]
        },
        {
            "title": "Refleksjon",
            "sections": [
                {
                    "title": "Hva har jeg lært gjennom denne oppgaven?",
                    "content": "Gjennom oppgaven har jeg lært at tidsfrister kan bli kortere og at å lese dokumentasjon hver gang man jobber kan være nyttig."
                },
                {
                    "title": "Hvordan har min innsats og fokus hvert?",
                    "content": "Jeg har hovedsakelig brukt tiden min på prosjektet, men mens jeg har ventet på ting så har vært og hjulpet andre med problemene de hadde fått. Det kan ha vært at fokuset mitt på mitt eget prosjekt forsvant litt når andre spurte om hjelp med sitt eget."
                },
                {
                    "title": "Om jeg skulle utføre denne oppgaven en gang til, er det noe jeg ville ha gjort annerledes?",
                    "content": "Hvis jeg skulle ha gjort oppgaven en gang til så ville jeg ha brukt slutten av timen 11.september på å skrive dokumentasjonen."
                }
            ]
        },
        {
            "title": "Hjulpet",
            "content": "I løpet av den tverrfaglige oppgaven så hadde fått hjulpet med BIOS som hadde vært settet til Legacy som gjorde at installasjons minnepinnen ikke ville starte. Hvordan sette en IPv4 adresse på Windows 10 fordi settings appen til 10 er ikke den beste på det og måtte endres fra kontrollpanelet. Hvordan man lager en brannmurs regel og hvilken regel er for å åpne for ping. Hvordan de skulle sette opp en FTP-server med brukere og hvordan de skulle koble til admin Interface av Filezilla serveren og hvilken porter blir brukt for FTP passive mode. Litt om hvordan partisjoner disken."
        }
    ]
}